{
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "dtype": "float32",
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ITEM_NAME",
    "2": "I-ITEM_NAME",
    "3": "B-ITEM_QTY",
    "4": "I-ITEM_QTY",
    "5": "B-ITEM_PRICE",
    "6": "I-ITEM_PRICE",
    "7": "B-SUBTOTAL",
    "8": "I-SUBTOTAL",
    "9": "B-TAX",
    "10": "I-TAX",
    "11": "B-DISCOUNT",
    "12": "I-DISCOUNT",
    "13": "B-TOTAL",
    "14": "I-TOTAL",
    "15": "B-PAYMENT",
    "16": "I-PAYMENT"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-DISCOUNT": 11,
    "B-ITEM_NAME": 1,
    "B-ITEM_PRICE": 5,
    "B-ITEM_QTY": 3,
    "B-PAYMENT": 15,
    "B-SUBTOTAL": 7,
    "B-TAX": 9,
    "B-TOTAL": 13,
    "I-DISCOUNT": 12,
    "I-ITEM_NAME": 2,
    "I-ITEM_PRICE": 6,
    "I-ITEM_QTY": 4,
    "I-PAYMENT": 16,
    "I-SUBTOTAL": 8,
    "I-TAX": 10,
    "I-TOTAL": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "visual_embed": true,
  "vocab_size": 50265
}
